2026.04.21.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2026.04.14.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2026.04.28.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of April 14 to 21, 2026.

#+TOC: headlines 1


* http-date v0.2 — Zero-dependency HTTP date parsing for OCaml
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-http-date-v0-2-zero-dependency-http-date-parsing-for-ocaml/17984/1

** Bikal Lem announced


 I just released v0.2 of http-date, an RFC 9110 compliant HTTP datetime decoder/encoder for OCaml.                      
   
  This is a major rewrite from v0.1. Here's what changed:                                                                
                                           
  Zero dependencies — Replaced the ocamllex/menhir parser with a hand-written implementation and removed the ptime       
  dependency entirely. The library now only requires ocaml and dune.
                                                                                                                         
  New type-safe API — The parsed result is now a polymorphic variant tagged by format (IMF, 
  RFC850, `ASCTIME), so you    
  always know which HTTP date format was parsed. The dayname, date, time, and datetime types are all exposed in the
  public API.                                                                                                            
                                           
  Serious testing — Added property-based tests with alcobar and AFL fuzz testing infrastructure to build confidence in
  the hand-written parser.

  If you're working with HTTP headers in OCaml, give it a try:                                                           
   
  opam install http-date                                                                                                 
                                           
https://github.com/bikallem/http-date
      



* Caqti 2.3.0
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-caqti-2-3-0/17985/1

** Petter A. Urkedal announced


I would like to announce the release of [[https://github.com/paurkedal/ocaml-caqti][Caqti]] 2.3.0.

TL;DR: Consider adding the ~caqti.classic~ to your link line (available since this version).  It currently only re-exports the ~caqti~ library, but will be replaced by a compatibility layer for the Caqti 2 API in Caqti 3 to allow incremental migration.

*** Release Notes

Note that some of the new features of this release are only accessible
through the still unstable ~caqti.template~ library, which will soon be
stabilized as part of an upcoming Caqti 3 API.  Due to adjustments to module
names, switching to ~caqti.template~ will not ensure future compatibility.
Instead, users are encouraged to add the new ~caqti.classic~ to their
dependencies to ease migration to Caqti 3.

  - Added an alias ~caqti.classic~ for the ~caqti~ library.  This will be
    turned into a library providing compatibility with the current Caqti 2
    API when Caqti 3 is released.  The two APIs can be used side-by-side to
    allow incremental migration.

  - The dialect descriptor for MariaDB in ~caqti.template~ now provides the
    server version.

  - Added ~Query.parens~, ~Query.litf~, ~Query.vars~, ~Row_type.fields~ to
    the ~caqti.template~ library.

  - Revised the interface for creating row types to allow instantiating
    parametric types applicatively.  Before this change, each application of
    a function representing a parametric type would generate a new type ID
    even when applied to the same type parameter argument.  The key part of
    this interface is the ~Caqti_template.Constructor_type~ module.

  - The query functions provided to request templates are now memoized, so
    that they are only called once per dialect.  This is meant as an
    optimization; it's still good practise to avoid side-effects here.

  - The new function ~Query.with_pos_of~ allows query generators to add
    source locations to the syntax tree, which will be emitted as SQL
    comments in the query string if the ~enable_query_annotations~ is set.
    This should simplify debugging when the query is assembled from
    different parts of the application code.

  - The still unstable ~caqti.template~ library now supports multiple
    statements in a single request template, sent opportunistically as a
    single query where allowed.  This is still experimental.

  - Fixed package scoping of shim rules for sqlite3 (#133 by mefyl).

  - Fixed the error classification for the SQLite3 driver (#132).

  - Fixed reconnect after connection loss for PostgreSQL.
      



* layoutz 0.1.0 🪶 - Zero-dep Elm-style TUIs and terminal plots for your OCaml apps
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-layoutz-0-1-0-zero-dep-elm-style-tuis-terminal-plots-for-your-ocaml-apps/17986/1

** Matthieu Court announced


Hello all! Thanks for your feedback last time - [[https://github.com/mattlianje/layoutz/tree/master/layoutz-ocaml][layoutz]] now has an Elm-style TUI runtime (quite [[https://github.com/mattlianje/layoutz/tree/master/layoutz-ocaml#faq][different in spirit]] than (the excellent) Minttea) … a smoothed API .. and terminal plot built-ins.

Looking for feedback! Many thanks
      



* Dune 3.22
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-3-22/17912/3

** Continuing this thread, Shon announced


The Dune team is pleased to announce [[https://github.com/ocaml/dune/releases/tag/3.22.2][the release of dune 3.22.2]].

This is a patch release consisting of bug fixes. See [[https://github.com/ocaml/dune/releases/tag/3.22.2][the full changelog]] for all the changes and for attribution to the contributors who made it all possible. Thank you, contributors!

If you encounter a problem with this release, please report it in [our issue

