2026.04.21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-21 Tue 11:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2026.04.14.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2026.04.28.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of April 14 to 21, 2026.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">http-date v0.2 — Zero-dependency HTTP date parsing for OCaml</a></li>
<li><a href="#2">Caqti 2.3.0</a></li>
<li><a href="#3">layoutz 0.1.0 🪶 - Zero-dep Elm-style TUIs and terminal plots for your OCaml apps</a></li>
<li><a href="#4">Dune 3.22</a></li>
<li><a href="#5">ptt, a mailing list system as unikernel</a></li>
<li><a href="#6">Mollymawk and Albatross orchestrating all virtual machines</a></li>
<li><a href="#7">OUPS meetup april 2026</a></li>
<li><a href="#8">Stk 0.6 released</a></li>
<li><a href="#9">opam 2.5.1</a></li>
<li><a href="#10">Restarting OCaml.jp: The OCaml Japan User Group</a></li>
<li><a href="#11">Code navigation and search on Github</a></li>
<li><a href="#12">Seeking maintainers for our OCaml SIP server, gRPC, and HTTP/2 libraries</a></li>
<li><a href="#13">ppx_mixins: slightly more elegant mixin syntax</a></li>
<li><a href="#14">Experience Report: Refining Dune’s Dependency Graph</a></li>
<li><a href="#15">First beta release of OCaml 5.5.0</a></li>
<li><a href="#16">ocgtk 0.1: OCaml bindings for GTK 4 (preview release)</a></li>
<li><a href="#orgc3cc6cf">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">http-date v0.2 — Zero-dependency HTTP date parsing for OCaml</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-http-date-v0-2-zero-dependency-http-date-parsing-for-ocaml/17984/1">https://discuss.ocaml.org/t/ann-http-date-v0-2-zero-dependency-http-date-parsing-for-ocaml/17984/1</a>
</p>
</div>
<div id="outline-container-org8bda44d" class="outline-3">
<h3 id="org8bda44d">Bikal Lem announced</h3>
<div class="outline-text-3" id="text-org8bda44d">
<p>
I just released v0.2 of http-date, an RFC 9110 compliant HTTP datetime decoder/encoder for OCaml.                      
</p>

<p>
This is a major rewrite from v0.1. Here's what changed:                                                                
</p>

<p>
Zero dependencies — Replaced the ocamllex/menhir parser with a hand-written implementation and removed the ptime       
dependency entirely. The library now only requires ocaml and dune.
</p>

<p>
New type-safe API — The parsed result is now a polymorphic variant tagged by format (IMF, 
RFC850, `ASCTIME), so you    
always know which HTTP date format was parsed. The dayname, date, time, and datetime types are all exposed in the
public API.                                                                                                            
</p>

<p>
Serious testing — Added property-based tests with alcobar and AFL fuzz testing infrastructure to build confidence in
the hand-written parser.
</p>

<p>
If you're working with HTTP headers in OCaml, give it a try:                                                           
</p>

<p>
opam install http-date                                                                                                 
</p>

<p>
<a href="https://github.com/bikallem/http-date">https://github.com/bikallem/http-date</a>
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Caqti 2.3.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-caqti-2-3-0/17985/1">https://discuss.ocaml.org/t/ann-caqti-2-3-0/17985/1</a>
</p>
</div>
<div id="outline-container-orgd95ea0b" class="outline-3">
<h3 id="orgd95ea0b">Petter A. Urkedal announced</h3>
<div class="outline-text-3" id="text-orgd95ea0b">
<p>
I would like to announce the release of <a href="https://github.com/paurkedal/ocaml-caqti">Caqti</a> 2.3.0.
</p>

<p>
TL;DR: Consider adding the <code>caqti.classic</code> to your link line (available since this version).  It currently only re-exports the <code>caqti</code> library, but will be replaced by a compatibility layer for the Caqti 2 API in Caqti 3 to allow incremental migration.
</p>
</div>
<div id="outline-container-orga52d7a5" class="outline-4">
<h4 id="orga52d7a5">Release Notes</h4>
<div class="outline-text-4" id="text-orga52d7a5">
<p>
Note that some of the new features of this release are only accessible
through the still unstable <code>caqti.template</code> library, which will soon be
stabilized as part of an upcoming Caqti 3 API.  Due to adjustments to module
names, switching to <code>caqti.template</code> will not ensure future compatibility.
Instead, users are encouraged to add the new <code>caqti.classic</code> to their
dependencies to ease migration to Caqti 3.
</p>

<ul class="org-ul">
<li>Added an alias <code>caqti.classic</code> for the <code>caqti</code> library.  This will be
turned into a library providing compatibility with the current Caqti 2
API when Caqti 3 is released.  The two APIs can be used side-by-side to
allow incremental migration.</li>

<li>The dialect descriptor for MariaDB in <code>caqti.template</code> now provides the
server version.</li>

<li>Added <code>Query.parens</code>, <code>Query.litf</code>, <code>Query.vars</code>, <code>Row_type.fields</code> to
the <code>caqti.template</code> library.</li>

<li>Revised the interface for creating row types to allow instantiating
parametric types applicatively.  Before this change, each application of
a function representing a parametric type would generate a new type ID
even when applied to the same type parameter argument.  The key part of
this interface is the <code>Caqti_template.Constructor_type</code> module.</li>

<li>The query functions provided to request templates are now memoized, so
that they are only called once per dialect.  This is meant as an
optimization; it's still good practise to avoid side-effects here.</li>

<li>The new function <code>Query.with_pos_of</code> allows query generators to add
source locations to the syntax tree, which will be emitted as SQL
comments in the query string if the <code>enable_query_annotations</code> is set.
This should simplify debugging when the query is assembled from
different parts of the application code.</li>

<li>The still unstable <code>caqti.template</code> library now supports multiple
statements in a single request template, sent opportunistically as a
single query where allowed.  This is still experimental.</li>

<li>Fixed package scoping of shim rules for sqlite3 (#133 by mefyl).</li>

<li>Fixed the error classification for the SQLite3 driver (#132).</li>

<li>Fixed reconnect after connection loss for PostgreSQL.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">layoutz 0.1.0 🪶 - Zero-dep Elm-style TUIs and terminal plots for your OCaml apps</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-layoutz-0-1-0-zero-dep-elm-style-tuis-terminal-plots-for-your-ocaml-apps/17986/1">https://discuss.ocaml.org/t/ann-layoutz-0-1-0-zero-dep-elm-style-tuis-terminal-plots-for-your-ocaml-apps/17986/1</a>
</p>
</div>
<div id="outline-container-orgcbccdd1" class="outline-3">
<h3 id="orgcbccdd1">Matthieu Court announced</h3>
<div class="outline-text-3" id="text-orgcbccdd1">
<p>
Hello all! Thanks for your feedback last time - <a href="https://github.com/mattlianje/layoutz/tree/master/layoutz-ocaml">layoutz</a> now has an Elm-style TUI runtime (quite <a href="https://github.com/mattlianje/layoutz/tree/master/layoutz-ocaml#faq">different in spirit</a> than (the excellent) Minttea) … a smoothed API .. and terminal plot built-ins.
</p>

<p>
Looking for feedback! Many thanks
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Dune 3.22</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-3-22/17912/3">https://discuss.ocaml.org/t/ann-dune-3-22/17912/3</a>
</p>
</div>
<div id="outline-container-org34ce07b" class="outline-3">
<h3 id="org34ce07b">Continuing this thread, Shon announced</h3>
<div class="outline-text-3" id="text-org34ce07b">
<p>
The Dune team is pleased to announce <a href="https://github.com/ocaml/dune/releases/tag/3.22.2">the release of dune 3.22.2</a>.
</p>

<p>
This is a patch release consisting of bug fixes. See <a href="https://github.com/ocaml/dune/releases/tag/3.22.2">the full changelog</a> for all the changes and for attribution to the contributors who made it all possible. Thank you, contributors!
</p>

<p>
If you encounter a problem with this release, please report it in [our issue
</p>
</div>
