2026.04.21.org
*** Fixed

- Revert the change in behavior of ~--diff-command~ back to 3.21. Non-existent files are now passed to this command instead of being replaced with /dev/null ([[https://github.com/ocaml/dune/pull/14098][#14098]], fixes 13891, [[https://github.com/rgrinberg][@rgrinberg]])
      



* ptt, a mailing list system as unikernel
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ann-ptt-a-mailing-list-system-as-unikernel/17987/1

** Calascibetta Romain announced


Hey! We just launched a new mailing list powered entirely by OCaml unikernels. The website (itself a unikernel) is at https://mailingl.st. You can subscribe to ptt@mailingl.st by sending an email to ptt-subscribe@mailingl.st if you're interested in the development and deployment of SMTP-related unikernels.

Fair warning: this is still a *public test* mailing list for now. In the long run, it will focus on our ptt project.

*** The SMTP protocol: a long and winding road!

**** In the beginning, email

It all started with [[https://github.com/mirage/mrmime][Mr.MIME]], our library for decoding and encoding emails. It's a synthesis of the relevant RFCs, but more importantly it's been battle-tested against real-world emails from the IEEE, [[https://www.cs.cmu.edu/~enron/][Enron]], [[https://yhbt.net/lore/kvm/][KVM]] and, most recently, the [[https://discuss.ocaml.org/t/is-there-a-public-archive-for-the-caml-list/16374/6?u=dinosaure][caml-list]].

This work also let us build [[https://github.com/mirage/hamlet][Hamlet]], a database of valid random emails generated using a fuzzer.

Under the hood, Mr.MIME relies on [[https://github.com/dinosaure/unstrctrd][unstrctrd]] for decoding the most general form of values found in an email (with internationalisation support via [[https://github.com/mirage/rosetta][rosetta]]) and [[https://github.com/dinosaure/prettym][prettym]] for encoding emails while respecting SMTP constraints and (Comment) Folding Whitespace handling.

**** Next, the protocol

Then came [[https://github.com/mirage/colombe][colombe]], our OCaml implementation of the SMTP protocol. It uses [[https://github.com/mirleft/ocaml-tls][ocaml-tls]] for ~STARTTLS~ support.

The protocol is supposedly "simple" (though the Internet always has surprises in store), but from day one we designed colombe to be independent of any scheduler and network layer. That way it slots right into unikernels without friction.

**** Finally, legitimacy

On top of these core components, we built several email security layers:
- [[https://github.com/mirage/ocaml-dkim][ocaml-dkim]] handles signing and verifying email integrity in a streaming fashion (both for verification and signature generation)
- [[https://github.com/mirage/uspf][uspf]] verifies sender identity and, like most of our libraries, stays independent of any scheduler or DNS implementation
- [[https://github.com/dinosaure/ocaml-dmarc][ocaml-dmarc]] automates DKIM and SPF verification, stamps emails with the result, and checks alignment across a domain name
- [ocaml-arc](github.com/robur-coop/ocaml-arc) lets you verify and sign emails to complete a chain of trust when an email passes through multiple SMTP servers (which is exactly what happens with a mailing list)

We wrote a short article about all of this [[https://blog.robur.coop/articles/2025-04-23-email-verification.html][here]].

*** All in the form of unikernels

Our first experiments already showed that we [[https://mirage.io/blog/2022-04-01-Mr-MIME][could handle emails]] with MirageOS unikernels. But we also hit real limitations: memory leaks, security vulnerabilities, and build issues.

So we decided to start fresh, and take the opportunity to fully embrace OCaml 5 and effects. We rebuilt the key pieces from scratch:
- a new effect-based scheduler: [[https://github.com/robur-coop/miou][Miou]]/[[https://github.com/robur-coop/mkernel][Mkernel]]
- a much more complete TCP/IP stack: [[https://github.com/robur-coop/mnet][Mnet]]
- a new FAT32 file system: [[https://github.com/robur-coop/mfat][Mfat]]

~ptt~ is built on this new stack, and so far we haven’t observed any memory leaks (thanks to [[https://git.robur.coop/robur/miou-solo5-memtrace][mkernel-memtrace]] for tracing memory usage, viewable via [[https://github.com/janestreet/memtrace/][memtrace-viewer]]). The CVEs related to [[https://github.com/mirage/mirage-tcpip][mirage-tcpip]] were taken into account during ~mnet~’s development, and the build story is much simpler now. A GitHub action can build and actually run the unikernel to test it, as you can see with [[https://github.com/robur-coop/mnet/blob/main/tests/simple.t][mnet]].

Other unikernels using this approach are available too. If you’re curious, check out [[https://robur-coop.github.io/mnet/][this tutorial]] on creating a unikernel in OCaml.

*** Deployment

~ptt~ also tackles the deployment question. We have [[https://blog.robur.coop/articles/2026-04-09-ptt.html][an article]] presenting the "stateless" aspect of ~ptt~. We'd also like to (re)introduce [Albatross](github.com/robur-coop/albatross), our secure unikernel orchestrator, and [[https://github.com/robur-coop/mollymawk/][Mollymawk]], a web interface for deploying unikernels (which is itself a unikernel).

More broadly, this is what [[https://robur.coop][our cooperative]] is working towards: we really want to improve the user experience, whether you're a developer or a deployer. We believe that actually developing, deploying, and using our unikernels is the only way to get them adopted more widely. So make sure to follow us on these projects too!

*** Usage

Along the way, we found it really helpful to have a tool that lets you track every stage of an email’s lifecycle. That’s how [[https://github.com/dinosaure/blaze][~blaze~]] came about: a Swiss Army knife for handling emails.

It’s still experimental, but it already lets you:
- use our archive system (generate, read, index, etc.)
- handle other archives such as ~mbox~ or ~maildir~
- communicate via the POP3 protocol
- sign and verify emails (DKIM and ARC)
- build emails from the command line
- send emails
- run a small local SMTP server

~blaze~ is how we iterate on our library APIs and validate implementations. It’s experimental, but it’s gradually turning into a full email client.

