2026.04.21.html
<div id="outline-container-org5781837" class="outline-4">
<h4 id="org5781837">Fixed</h4>
<div class="outline-text-4" id="text-org5781837">
<ul class="org-ul">
<li>Revert the change in behavior of <code>--diff-command</code> back to 3.21. Non-existent files are now passed to this command instead of being replaced with /dev/null (<a href="https://github.com/ocaml/dune/pull/14098">#14098</a>, fixes 13891, <a href="https://github.com/rgrinberg">@rgrinberg</a>)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">ptt, a mailing list system as unikernel</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ptt-a-mailing-list-system-as-unikernel/17987/1">https://discuss.ocaml.org/t/ann-ptt-a-mailing-list-system-as-unikernel/17987/1</a>
</p>
</div>
<div id="outline-container-orgfae88f2" class="outline-3">
<h3 id="orgfae88f2">Calascibetta Romain announced</h3>
<div class="outline-text-3" id="text-orgfae88f2">
<p>
Hey! We just launched a new mailing list powered entirely by OCaml unikernels. The website (itself a unikernel) is at <a href="https://mailingl.st">https://mailingl.st</a>. You can subscribe to ptt@mailingl.st by sending an email to ptt-subscribe@mailingl.st if you're interested in the development and deployment of SMTP-related unikernels.
</p>

<p>
Fair warning: this is still a <b>public test</b> mailing list for now. In the long run, it will focus on our ptt project.
</p>
</div>
<div id="outline-container-org2d30303" class="outline-4">
<h4 id="org2d30303">The SMTP protocol: a long and winding road!</h4>
<div class="outline-text-4" id="text-org2d30303">
</div>
<ul class="org-ul">
<li><a id="org90d5109"></a>In the beginning, email<br />
<div class="outline-text-5" id="text-org90d5109">
<p>
It all started with <a href="https://github.com/mirage/mrmime">Mr.MIME</a>, our library for decoding and encoding emails. It's a synthesis of the relevant RFCs, but more importantly it's been battle-tested against real-world emails from the IEEE, <a href="https://www.cs.cmu.edu/~enron/">Enron</a>, <a href="https://yhbt.net/lore/kvm/">KVM</a> and, most recently, the <a href="https://discuss.ocaml.org/t/is-there-a-public-archive-for-the-caml-list/16374/6?u=dinosaure">caml-list</a>.
</p>

<p>
This work also let us build <a href="https://github.com/mirage/hamlet">Hamlet</a>, a database of valid random emails generated using a fuzzer.
</p>

<p>
Under the hood, Mr.MIME relies on <a href="https://github.com/dinosaure/unstrctrd">unstrctrd</a> for decoding the most general form of values found in an email (with internationalisation support via <a href="https://github.com/mirage/rosetta">rosetta</a>) and <a href="https://github.com/dinosaure/prettym">prettym</a> for encoding emails while respecting SMTP constraints and (Comment) Folding Whitespace handling.
</p>
</div>
</li>
<li><a id="orgf11f880"></a>Next, the protocol<br />
<div class="outline-text-5" id="text-orgf11f880">
<p>
Then came <a href="https://github.com/mirage/colombe">colombe</a>, our OCaml implementation of the SMTP protocol. It uses <a href="https://github.com/mirleft/ocaml-tls">ocaml-tls</a> for <code>STARTTLS</code> support.
</p>

<p>
The protocol is supposedly "simple" (though the Internet always has surprises in store), but from day one we designed colombe to be independent of any scheduler and network layer. That way it slots right into unikernels without friction.
</p>
</div>
</li>
<li><a id="org39c65b9"></a>Finally, legitimacy<br />
<div class="outline-text-5" id="text-org39c65b9">
<p>
On top of these core components, we built several email security layers:
</p>
<ul class="org-ul">
<li><a href="https://github.com/mirage/ocaml-dkim">ocaml-dkim</a> handles signing and verifying email integrity in a streaming fashion (both for verification and signature generation)</li>
<li><a href="https://github.com/mirage/uspf">uspf</a> verifies sender identity and, like most of our libraries, stays independent of any scheduler or DNS implementation</li>
<li><a href="https://github.com/dinosaure/ocaml-dmarc">ocaml-dmarc</a> automates DKIM and SPF verification, stamps emails with the result, and checks alignment across a domain name</li>
<li>[ocaml-arc](github.com/robur-coop/ocaml-arc) lets you verify and sign emails to complete a chain of trust when an email passes through multiple SMTP servers (which is exactly what happens with a mailing list)</li>
</ul>

<p>
We wrote a short article about all of this <a href="https://blog.robur.coop/articles/2025-04-23-email-verification.html">here</a>.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga817fa1" class="outline-4">
<h4 id="orga817fa1">All in the form of unikernels</h4>
<div class="outline-text-4" id="text-orga817fa1">
<p>
Our first experiments already showed that we <a href="https://mirage.io/blog/2022-04-01-Mr-MIME">could handle emails</a> with MirageOS unikernels. But we also hit real limitations: memory leaks, security vulnerabilities, and build issues.
</p>

<p>
So we decided to start fresh, and take the opportunity to fully embrace OCaml 5 and effects. We rebuilt the key pieces from scratch:
</p>
<ul class="org-ul">
<li>a new effect-based scheduler: <a href="https://github.com/robur-coop/miou">Miou</a>/<a href="https://github.com/robur-coop/mkernel">Mkernel</a></li>
<li>a much more complete TCP/IP stack: <a href="https://github.com/robur-coop/mnet">Mnet</a></li>
<li>a new FAT32 file system: <a href="https://github.com/robur-coop/mfat">Mfat</a></li>
</ul>

<p>
<code>ptt</code> is built on this new stack, and so far we haven’t observed any memory leaks (thanks to <a href="https://git.robur.coop/robur/miou-solo5-memtrace">mkernel-memtrace</a> for tracing memory usage, viewable via <a href="https://github.com/janestreet/memtrace/">memtrace-viewer</a>). The CVEs related to <a href="https://github.com/mirage/mirage-tcpip">mirage-tcpip</a> were taken into account during ~mnet~’s development, and the build story is much simpler now. A GitHub action can build and actually run the unikernel to test it, as you can see with <a href="https://github.com/robur-coop/mnet/blob/main/tests/simple.t">mnet</a>.
</p>

<p>
Other unikernels using this approach are available too. If you’re curious, check out <a href="https://robur-coop.github.io/mnet/">this tutorial</a> on creating a unikernel in OCaml.
</p>
</div>
</div>
<div id="outline-container-org29f2635" class="outline-4">
<h4 id="org29f2635">Deployment</h4>
<div class="outline-text-4" id="text-org29f2635">
<p>
<code>ptt</code> also tackles the deployment question. We have <a href="https://blog.robur.coop/articles/2026-04-09-ptt.html">an article</a> presenting the "stateless" aspect of <code>ptt</code>. We'd also like to (re)introduce [Albatross](github.com/robur-coop/albatross), our secure unikernel orchestrator, and <a href="https://github.com/robur-coop/mollymawk/">Mollymawk</a>, a web interface for deploying unikernels (which is itself a unikernel).
</p>

<p>
More broadly, this is what <a href="https://robur.coop">our cooperative</a> is working towards: we really want to improve the user experience, whether you're a developer or a deployer. We believe that actually developing, deploying, and using our unikernels is the only way to get them adopted more widely. So make sure to follow us on these projects too!
</p>
</div>
</div>
<div id="outline-container-orge2e975b" class="outline-4">
<h4 id="orge2e975b">Usage</h4>
<div class="outline-text-4" id="text-orge2e975b">
<p>
Along the way, we found it really helpful to have a tool that lets you track every stage of an email’s lifecycle. That’s how <a href="https://github.com/dinosaure/blaze"><code>blaze</code></a> came about: a Swiss Army knife for handling emails.
</p>

<p>
It’s still experimental, but it already lets you:
</p>
<ul class="org-ul">
<li>use our archive system (generate, read, index, etc.)</li>
<li>handle other archives such as <code>mbox</code> or <code>maildir</code></li>
<li>communicate via the POP3 protocol</li>
<li>sign and verify emails (DKIM and ARC)</li>
<li>build emails from the command line</li>
<li>send emails</li>
<li>run a small local SMTP server</li>
</ul>

<p>
<code>blaze</code> is how we iterate on our library APIs and validate implementations. It’s experimental, but it’s gradually turning into a full email client.
</p>
</div>
<ul class="org-ul">
