2026.04.21.org
**** Archiving & Indexing

We'd also like to present the [[https://git.robur.coop/robur/stem][stem]] project, which extracts word roots from a document (such as an email) and tokenises them to get something analysable without the complexity of natural language. This tokenisation is what powers our small [[https://en.wikipedia.org/wiki/Okapi_BM25][bm25]] search engine. You can see results [[https://blog.robur.coop/articles/ptt_stem_and_search_engine.html][here]].

This is also what drives our caml-list search engine, available as a unikernel: [[https://github.com/robur-coop/blame][blame]], which you can try at https://caml-list.robur.coop (powered by [[https://github.com/robur-coop/vif][vif]]).

Beyond search, there's also email indexing via Message-IDs. For that we built [[https://github.com/robur-coop/bancos][bancos]]: a *persistent* radix tree in OCaml that supports *parallel* access! More details [[https://blog.robur.coop/articles/2025-18-12-bancos.html][here]].

Finally, our indexing system uses the PACKv2 format (the same one Git uses to store objects), implemented by the [[https://github.com/robur-coop/carton][carton]] library. It has proven its stability through the [[https://github.com/mirage/ocaml-git][ocaml-git]] project, so we decided to reuse it for archiving emails (much like [[https://public-inbox.org/README][public-inbox]] did, though in a different form).

*** Conclusion

Thanks to all this work, OCaml now has a solid set of email-related projects. This journey started back in 2016 and there's still a long way to go, as we always aim to offer robu(r)st, battle-tested solutions. Unlike some implementations in other languages (though we are in discussion with folks in the Rust community), ours actually adhere to the standards!

It may not seem like a big deal, and you won't see any major difference when just exchanging emails, but we believe this approach paves the way for a better internet. In the form of unikernels, it represents a genuine reclaiming of the means of communication!
      



* Mollymawk and Albatross orchestrating all virtual machines
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-mollymawk-and-albatross-orchestrating-all-virtual-machines/17988/1

** Hannes Mehnert announced


Dear everyone,

we just finished and deployed [[https://github.com/robur-coop/albatross][Albatross]] and [[https://github.com/robur-coop/mollymawk][Mollymawk]] to support virtual machines that are not MirageOS unikernels.

The reasoning is simple: we embedded so many nice features (metrics, console output, deploying via web UI, multi-tenant, startup dependencies, restart-on-failure,..) that we really wanted to deploy our non-MirageOS virtual machines as well with the same mechanism and don't have duplicated code all over.

For the time being, it only supports FreeBSD BHyve, but let us know if you're interested in other virtualization technologies and we will prioritize that work!

We also wrote a brief blog article with screenshots: https://blog.robur.coop/articles/mollymawk-other.html
      



* OUPS meetup april 2026
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/oups-meetup-april-2026/17989/1

** ancolie announced


The next OUPS meetup will take place on *Wednesday, 29th of April* 2026. It will start at *6:30pm* at the *45 rue d'Ulm* in Paris. It will be in the in the *Rataud amphitheater*.

:warning: It's not in Jussieu as usual but in ENS Ulm! If you're not familiar with the place, there is a [[https://www.ens.psl.eu/IMG/pdf/Plan_45ULM_SS.pdf][map of the buildings]].

Please, *[[https://www.meetup.com/ocaml-paris/events/314296893/][register on meetup ]]* as soon as possible to let us know how many pizza we should order.

For more details, you may check the [[https://oups.frama.io][OUPS’ website ]].

Moreover, we’d like to announce that the organizing team moved to the [[https://ocaml.zulipchat.com][OCaml Zulip]]. Feel free to contact us there if you’d like to suggest talks.

---

This time we’ll have the following talks:

*When Turing machines meet GADTs -- Florian Angeletti*

Have you ever wondered why one needs to write down explicit
unreachable clauses in a GADT-pattern matching? Or how much
computation one can sneak inside an OCaml type?

This talk proposes to answers those questions and more with a deep dive
into GADTs, the OCaml compiler implementation of the exhaustiveness
checking for pattern match, and how to best trick the typechecker into
finding the BB(3) champion by itself.

*Extending OCaml's pattern matching -- Yanni Lefki*

Pattern matching has been studied for decades and has been the subject of extensive research and numerous extensions. Nevertheless, recent language features—such as Rust’s if-let construct, and recent work such as Cheng and Parreaux (OOPSLA 2024), suggest that there is still room for improvement. We propose a streamlined approach that unifies pattern matching with extended forms of conditionals.

In particular, our prototype introduces binding-boolean-expressions, which allow variables to be bound within pattern guards, within if-conditions (and subsequently used in the then branch), and within while-conditions (and used in the loop body). Our system also incorporates Haskell-style views, enabling the definition of smart deconstructors, the dual of smart constructors.

In this talk, we present an ML-like language equipped with evaluation rules, typing rules, and a simple compilation scheme. We conclude with a demonstration of our implementation: an OCaml PPX prototype that parses an extended ML syntax exposing these constructs, type-checks programs according to our (highly intuitive!) rules, and translates them into a correct OCaml AST via our (non-optimizing) transformation.

---

After the talks there will be some pizzas offered by the [[https://ocaml-sf.org][OCaml Software Foundation]] and later on we’ll move to a pub nearby as usual.
      



* Stk 0.6 released
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-stk-0-6-released/17994/1

** Zoggy announced


Hello,

Stk is a SDL-based graphical user interface toolkit. Its interface is inspired by Gtk and should look familiar to developers using Lablgtk.

Stk 0.6 is available. Among changes listed [[https://zoggy.frama.io/ocaml-stk/posts/release-0.6.0.html][here]], this release introduces [[https://zoggy.frama.io/ocaml-stk/refdoc/stk/Stk/Tooltip/index.html][Tooltips]] and [[https://zoggy.frama.io/ocaml-stk/doc-config.html][handling of user's configuration]], including user-defined themes.

The ~stk*~ packages are available from my [[https://framagit.org/zoggy/opam-repository][personal opam repository]].
      



* opam 2.5.1
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/ann-opam-2-5-1/17997/1

