2026.04.21.html
<li><a id="orgc67e720"></a>Archiving &amp; Indexing<br />
<div class="outline-text-5" id="text-orgc67e720">
<p>
We'd also like to present the <a href="https://git.robur.coop/robur/stem">stem</a> project, which extracts word roots from a document (such as an email) and tokenises them to get something analysable without the complexity of natural language. This tokenisation is what powers our small <a href="https://en.wikipedia.org/wiki/Okapi_BM25">bm25</a> search engine. You can see results <a href="https://blog.robur.coop/articles/ptt_stem_and_search_engine.html">here</a>.
</p>

<p>
This is also what drives our caml-list search engine, available as a unikernel: <a href="https://github.com/robur-coop/blame">blame</a>, which you can try at <a href="https://caml-list.robur.coop">https://caml-list.robur.coop</a> (powered by <a href="https://github.com/robur-coop/vif">vif</a>).
</p>

<p>
Beyond search, there's also email indexing via Message-IDs. For that we built <a href="https://github.com/robur-coop/bancos">bancos</a>: a <b>persistent</b> radix tree in OCaml that supports <b>parallel</b> access! More details <a href="https://blog.robur.coop/articles/2025-18-12-bancos.html">here</a>.
</p>

<p>
Finally, our indexing system uses the PACKv2 format (the same one Git uses to store objects), implemented by the <a href="https://github.com/robur-coop/carton">carton</a> library. It has proven its stability through the <a href="https://github.com/mirage/ocaml-git">ocaml-git</a> project, so we decided to reuse it for archiving emails (much like <a href="https://public-inbox.org/README">public-inbox</a> did, though in a different form).
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org1105639" class="outline-4">
<h4 id="org1105639">Conclusion</h4>
<div class="outline-text-4" id="text-org1105639">
<p>
Thanks to all this work, OCaml now has a solid set of email-related projects. This journey started back in 2016 and there's still a long way to go, as we always aim to offer robu(r)st, battle-tested solutions. Unlike some implementations in other languages (though we are in discussion with folks in the Rust community), ours actually adhere to the standards!
</p>

<p>
It may not seem like a big deal, and you won't see any major difference when just exchanging emails, but we believe this approach paves the way for a better internet. In the form of unikernels, it represents a genuine reclaiming of the means of communication!
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Mollymawk and Albatross orchestrating all virtual machines</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mollymawk-and-albatross-orchestrating-all-virtual-machines/17988/1">https://discuss.ocaml.org/t/ann-mollymawk-and-albatross-orchestrating-all-virtual-machines/17988/1</a>
</p>
</div>
<div id="outline-container-org36ef5bb" class="outline-3">
<h3 id="org36ef5bb">Hannes Mehnert announced</h3>
<div class="outline-text-3" id="text-org36ef5bb">
<p>
Dear everyone,
</p>

<p>
we just finished and deployed <a href="https://github.com/robur-coop/albatross">Albatross</a> and <a href="https://github.com/robur-coop/mollymawk">Mollymawk</a> to support virtual machines that are not MirageOS unikernels.
</p>

<p>
The reasoning is simple: we embedded so many nice features (metrics, console output, deploying via web UI, multi-tenant, startup dependencies, restart-on-failure,..) that we really wanted to deploy our non-MirageOS virtual machines as well with the same mechanism and don't have duplicated code all over.
</p>

<p>
For the time being, it only supports FreeBSD BHyve, but let us know if you're interested in other virtualization technologies and we will prioritize that work!
</p>

<p>
We also wrote a brief blog article with screenshots: <a href="https://blog.robur.coop/articles/mollymawk-other.html">https://blog.robur.coop/articles/mollymawk-other.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="7">OUPS meetup april 2026</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/oups-meetup-april-2026/17989/1">https://discuss.ocaml.org/t/oups-meetup-april-2026/17989/1</a>
</p>
</div>
<div id="outline-container-orgc372f54" class="outline-3">
<h3 id="orgc372f54">ancolie announced</h3>
<div class="outline-text-3" id="text-orgc372f54">
<p>
The next OUPS meetup will take place on <b>Wednesday, 29th of April</b> 2026. It will start at <b>6:30pm</b> at the <b>45 rue d'Ulm</b> in Paris. It will be in the in the <b>Rataud amphitheater</b>.
</p>

<p>
:warning: It's not in Jussieu as usual but in ENS Ulm! If you're not familiar with the place, there is a <a href="https://www.ens.psl.eu/IMG/pdf/Plan_45ULM_SS.pdf">map of the buildings</a>.
</p>

<p>
Please, <b><a href="https://www.meetup.com/ocaml-paris/events/314296893/">register on meetup </a></b> as soon as possible to let us know how many pizza we should order.
</p>

<p>
For more details, you may check the <a href="https://oups.frama.io">OUPS’ website </a>.
</p>

<p>
Moreover, we’d like to announce that the organizing team moved to the <a href="https://ocaml.zulipchat.com">OCaml Zulip</a>. Feel free to contact us there if you’d like to suggest talks.
</p>

<p>
&mdash;
</p>

<p>
This time we’ll have the following talks:
</p>

<p>
<b>When Turing machines meet GADTs &ndash; Florian Angeletti</b>
</p>

<p>
Have you ever wondered why one needs to write down explicit
unreachable clauses in a GADT-pattern matching? Or how much
computation one can sneak inside an OCaml type?
</p>

<p>
This talk proposes to answers those questions and more with a deep dive
into GADTs, the OCaml compiler implementation of the exhaustiveness
checking for pattern match, and how to best trick the typechecker into
finding the BB(3) champion by itself.
</p>

<p>
<b>Extending OCaml's pattern matching &ndash; Yanni Lefki</b>
</p>

<p>
Pattern matching has been studied for decades and has been the subject of extensive research and numerous extensions. Nevertheless, recent language features—such as Rust’s if-let construct, and recent work such as Cheng and Parreaux (OOPSLA 2024), suggest that there is still room for improvement. We propose a streamlined approach that unifies pattern matching with extended forms of conditionals.
</p>

<p>
In particular, our prototype introduces binding-boolean-expressions, which allow variables to be bound within pattern guards, within if-conditions (and subsequently used in the then branch), and within while-conditions (and used in the loop body). Our system also incorporates Haskell-style views, enabling the definition of smart deconstructors, the dual of smart constructors.
</p>

<p>
In this talk, we present an ML-like language equipped with evaluation rules, typing rules, and a simple compilation scheme. We conclude with a demonstration of our implementation: an OCaml PPX prototype that parses an extended ML syntax exposing these constructs, type-checks programs according to our (highly intuitive!) rules, and translates them into a correct OCaml AST via our (non-optimizing) transformation.
</p>

<p>
&mdash;
</p>

<p>
After the talks there will be some pizzas offered by the <a href="https://ocaml-sf.org">OCaml Software Foundation</a> and later on we’ll move to a pub nearby as usual.
</p>
</div>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="8">Stk 0.6 released</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-stk-0-6-released/17994/1">https://discuss.ocaml.org/t/ann-stk-0-6-released/17994/1</a>
</p>
</div>
<div id="outline-container-orgd87bc95" class="outline-3">
<h3 id="orgd87bc95">Zoggy announced</h3>
<div class="outline-text-3" id="text-orgd87bc95">
<p>
Hello,
</p>

<p>
Stk is a SDL-based graphical user interface toolkit. Its interface is inspired by Gtk and should look familiar to developers using Lablgtk.
</p>

<p>
Stk 0.6 is available. Among changes listed <a href="https://zoggy.frama.io/ocaml-stk/posts/release-0.6.0.html">here</a>, this release introduces <a href="https://zoggy.frama.io/ocaml-stk/refdoc/stk/Stk/Tooltip/index.html">Tooltips</a> and <a href="https://zoggy.frama.io/ocaml-stk/doc-config.html">handling of user's configuration</a>, including user-defined themes.
</p>

<p>
The <code>stk*</code> packages are available from my <a href="https://framagit.org/zoggy/opam-repository">personal opam repository</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-9" class="outline-2">
<h2 id="9">opam 2.5.1</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-2-5-1/17997/1">https://discuss.ocaml.org/t/ann-opam-2-5-1/17997/1</a>
</p>
</div>
