2026.04.21.org
** Kate announced


Hi everyone,

opam 2.5.1 is now available. This release is fixing a security issue ([[https://github.com/ocaml/security-advisories/blob/main/advisories/2026/OSEC-2026-03.md][OSEC-2026-03]]) and other minor things. /Thanks to [[https://github.com/andrew][@andrew]] for reporting this issue./

We invite everyone to upgrade to 2.5.1 as soon as possible.

If you depend on the older opam package of your preferred distribution, distributions such as Debian Stable have already started backporting the relevant fix and the patched version should be available there very soon.

You can read our [[https://opam.ocaml.org/blog/opam-2-5-1/][blog post]] for relevant links and details.

*** Try it!

The upgrade instructions are unchanged:

For Unix systems
#+begin_quote
bash -c "sh <(curl -fsSL https://opam.ocaml.org/install.sh) --version 2.5.1"
#+end_quote
or from PowerShell for Windows systems
#+begin_quote
Invoke-Expression "& { $(Invoke-RestMethod https://opam.ocaml.org/install.ps1) } -Version 2.5.1"
#+end_quote
Please report any issues to the [[https://github.com/ocaml/opam/issues][bug-tracker]].

Happy hacking,

<> <> The opam team <> <> :camel:
      



* Restarting OCaml.jp: The OCaml Japan User Group
:PROPERTIES:
:CUSTOM_ID: 10
:END:
Archive: https://discuss.ocaml.org/t/ann-restarting-ocaml-jp-the-ocaml-japan-user-group/17998/1

** mt_caret announced


Dear OCaml community,

We're excited to announce the relaunch of *OCaml.jp* ([[https://ocaml.jp/][https://ocaml.jp/]]), the OCaml Japan User Group!

Our goal is to grow and energize the OCaml community in Japan by bringing together users to foster broader adoption and deeper engagement with OCaml across the country.

*** Current Activities

We've already kicked off a couple of initiatives:

- *OCaml Weekly News - Japanese Edition*: We're maintaining a Japanese translation of the OCaml Weekly News at [[https://ocaml.jp/cwn-ja/][https://ocaml.jp/cwn-ja/]], making it easier for Japanese speakers to stay up to date with the latest happenings in the OCaml ecosystem.
- *OCaml Meetup in Tokyo (August 2026)*: We are currently preparing to host an OCaml Meetup in Tokyo this August, the first one in [[https://ocaml.jp/events/][over ten years]]! More details will be shared soon; please stay tuned!

*** Join Us!

We're using *Discord* as our primary communication platforms. Whether you're based in Japan, are a Japanese-speaking OCaml enthusiast anywhere in the world, or simply want to connect with the Japanese OCaml community, we'd love to have you join us!

Please use the following link to join Discord: [[https://discord.gg/qQTbny8KF4][https://discord.gg/qQTbny8KF4]]

We look forward to building a vibrant OCaml community in Japan together. よろしくお願いします！
      



* Code navigation and search on Github
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/ann-code-navigation-and-search-on-github/17999/1

** Pieter Goetschalckx announced


GitHub is now using [[https://github.com/tree-sitter/tree-sitter-ocaml][tree-sitter-ocaml]] for [[https://docs.github.com/en/repositories/working-with-files/using-files/navigating-code-on-github][code navigation]] and [[https://docs.github.com/en/search-github/github-code-search/understanding-github-code-search-syntax#symbol-qualifier][code search]].

- Code highlighting should be more accurate (compared to the old TextMate grammar) and supports all features up to OCaml 5.4.
- There is a symbols side panel for each file.
- You can click on symbols to find definitions and references.
- You can [[https://github.com/search?q=repo%3Aocaml%2Focaml+def%3Afind&type=code][search for definitions]].
- There is limited support for [[https://github.com/search?q=repo%3Aocaml%2Focaml+Make.t&type=code][nested structures]].

They enabled it [[https://github.com/github/code-navigation/issues/14][a few months ago]] already, but I forgot to post it here.

The code navigation is not always 100% accurate, but good enough to be helpful. If you encounter any issues with incorrectly highlighted code, this could be a tree-sitter-ocaml issue.
      



* Seeking maintainers for our OCaml SIP server, gRPC, and HTTP/2 libraries
:PROPERTIES:
:CUSTOM_ID: 12
:END:
Archive: https://discuss.ocaml.org/t/seeking-maintainers-for-our-ocaml-sip-server-grpc-and-http-2-libraries/18000/1

