2026.04.21.html
<div id="outline-container-org51f738a" class="outline-3">
<h3 id="org51f738a">Kate announced</h3>
<div class="outline-text-3" id="text-org51f738a">
<p>
Hi everyone,
</p>

<p>
opam 2.5.1 is now available. This release is fixing a security issue (<a href="https://github.com/ocaml/security-advisories/blob/main/advisories/2026/OSEC-2026-03.md">OSEC-2026-03</a>) and other minor things. <i>Thanks to <a href="https://github.com/andrew">@andrew</a> for reporting this issue.</i>
</p>

<p>
We invite everyone to upgrade to 2.5.1 as soon as possible.
</p>

<p>
If you depend on the older opam package of your preferred distribution, distributions such as Debian Stable have already started backporting the relevant fix and the patched version should be available there very soon.
</p>

<p>
You can read our <a href="https://opam.ocaml.org/blog/opam-2-5-1/">blog post</a> for relevant links and details.
</p>
</div>
<div id="outline-container-org36762fe" class="outline-4">
<h4 id="org36762fe">Try it!</h4>
<div class="outline-text-4" id="text-org36762fe">
<p>
The upgrade instructions are unchanged:
</p>

<p>
For Unix systems
</p>
<blockquote>
<p>
bash -c "sh &lt;(curl -fsSL <a href="https://opam.ocaml.org/install.sh">https://opam.ocaml.org/install.sh</a>) &ndash;version 2.5.1"
</p>
</blockquote>
<p>
or from PowerShell for Windows systems
</p>
<blockquote>
<p>
Invoke-Expression "&amp; { $(Invoke-RestMethod <a href="https://opam.ocaml.org/install.ps1">https://opam.ocaml.org/install.ps1</a>) } -Version 2.5.1"
</p>
</blockquote>
<p>
Please report any issues to the <a href="https://github.com/ocaml/opam/issues">bug-tracker</a>.
</p>

<p>
Happy hacking,
</p>

<p>
&lt;&gt; &lt;&gt; The opam team &lt;&gt; &lt;&gt; :camel:
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-10" class="outline-2">
<h2 id="10">Restarting OCaml.jp: The OCaml Japan User Group</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-restarting-ocaml-jp-the-ocaml-japan-user-group/17998/1">https://discuss.ocaml.org/t/ann-restarting-ocaml-jp-the-ocaml-japan-user-group/17998/1</a>
</p>
</div>
<div id="outline-container-org48e4337" class="outline-3">
<h3 id="org48e4337">mt_caret announced</h3>
<div class="outline-text-3" id="text-org48e4337">
<p>
Dear OCaml community,
</p>

<p>
We're excited to announce the relaunch of <b>OCaml.jp</b> (<a href="https://ocaml.jp/">https://ocaml.jp/</a>), the OCaml Japan User Group!
</p>

<p>
Our goal is to grow and energize the OCaml community in Japan by bringing together users to foster broader adoption and deeper engagement with OCaml across the country.
</p>
</div>
<div id="outline-container-org4741324" class="outline-4">
<h4 id="org4741324">Current Activities</h4>
<div class="outline-text-4" id="text-org4741324">
<p>
We've already kicked off a couple of initiatives:
</p>

<ul class="org-ul">
<li><b>OCaml Weekly News - Japanese Edition</b>: We're maintaining a Japanese translation of the OCaml Weekly News at <a href="https://ocaml.jp/cwn-ja/">https://ocaml.jp/cwn-ja/</a>, making it easier for Japanese speakers to stay up to date with the latest happenings in the OCaml ecosystem.</li>
<li><b>OCaml Meetup in Tokyo (August 2026)</b>: We are currently preparing to host an OCaml Meetup in Tokyo this August, the first one in <a href="https://ocaml.jp/events/">over ten years</a>! More details will be shared soon; please stay tuned!</li>
</ul>
</div>
</div>
<div id="outline-container-orgfdf016b" class="outline-4">
<h4 id="orgfdf016b">Join Us!</h4>
<div class="outline-text-4" id="text-orgfdf016b">
<p>
We're using <b>Discord</b> as our primary communication platforms. Whether you're based in Japan, are a Japanese-speaking OCaml enthusiast anywhere in the world, or simply want to connect with the Japanese OCaml community, we'd love to have you join us!
</p>

<p>
Please use the following link to join Discord: <a href="https://discord.gg/qQTbny8KF4">https://discord.gg/qQTbny8KF4</a>
</p>

<p>
We look forward to building a vibrant OCaml community in Japan together. よろしくお願いします！
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-11" class="outline-2">
<h2 id="11">Code navigation and search on Github</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-code-navigation-and-search-on-github/17999/1">https://discuss.ocaml.org/t/ann-code-navigation-and-search-on-github/17999/1</a>
</p>
</div>
<div id="outline-container-org1f90d90" class="outline-3">
<h3 id="org1f90d90">Pieter Goetschalckx announced</h3>
<div class="outline-text-3" id="text-org1f90d90">
<p>
GitHub is now using <a href="https://github.com/tree-sitter/tree-sitter-ocaml">tree-sitter-ocaml</a> for <a href="https://docs.github.com/en/repositories/working-with-files/using-files/navigating-code-on-github">code navigation</a> and <a href="https://docs.github.com/en/search-github/github-code-search/understanding-github-code-search-syntax#symbol-qualifier">code search</a>.
</p>

<ul class="org-ul">
<li>Code highlighting should be more accurate (compared to the old TextMate grammar) and supports all features up to OCaml 5.4.</li>
<li>There is a symbols side panel for each file.</li>
<li>You can click on symbols to find definitions and references.</li>
<li>You can <a href="https://github.com/search?q=repo%3Aocaml%2Focaml+def%3Afind&amp;type=code">search for definitions</a>.</li>
<li>There is limited support for <a href="https://github.com/search?q=repo%3Aocaml%2Focaml+Make.t&amp;type=code">nested structures</a>.</li>
</ul>

<p>
They enabled it <a href="https://github.com/github/code-navigation/issues/14">a few months ago</a> already, but I forgot to post it here.
</p>

<p>
The code navigation is not always 100% accurate, but good enough to be helpful. If you encounter any issues with incorrectly highlighted code, this could be a tree-sitter-ocaml issue.
</p>
</div>
</div>
</div>
<div id="outline-container-12" class="outline-2">
<h2 id="12">Seeking maintainers for our OCaml SIP server, gRPC, and HTTP/2 libraries</h2>
<div class="outline-text-2" id="text-12">
<p>
Archive: <a href="https://discuss.ocaml.org/t/seeking-maintainers-for-our-ocaml-sip-server-grpc-and-http-2-libraries/18000/1">https://discuss.ocaml.org/t/seeking-maintainers-for-our-ocaml-sip-server-grpc-and-http-2-libraries/18000/1</a>
</p>
</div>
