2026.04.21.org
** Wojtek Czekalski announced


As we're moving off OCaml at [[https://dialo.ai/][dialo]], we'd like to donate the libraries we built to people who will properly maintain them. We built a highly performant telephony system using OCaml, but as a small team we ended up maintaining too much software for our liking.

We initially built a SIP server implementation in OCaml, which was a perfect fit. We needed to connect it to the rest of our system in a language agnostic way. We chose gRPC and that's where things got difficult.

At a smaller scale our own buggy implementation of gRPC on top of [[https://github.com/anmonteiro/ocaml-h2][h2]] was good enough. Then we started scaling and at the same time transitioned to OCaml 5.0. The combination of those factors resulted in:

1. Performance regressions in 5.0 related to memory management, both inside of app code, SIP stack, and inside of h2.
2. We needed a more robust implementation of gRPC to handle errors and edge cases better.

Long story short we ended up:

1. Writing our own implementation of [[https://github.com/dialohq/haha][http2]]
2. Rewriting the gRPC library exclusively for eio to limit the scope together with [[https://github.com/dialohq/ocaml-grpc/blob/dialo/examples/routeguide/src/client.ml][decent codegen]] and robust

Then, in late 2025, we had to add new features to the SIP server and something inside us just broke. The SIP server had accumulated quite a bit of legacy code over 3.5 years, so we wanted to rewrite some parts. We were extremely excited to build the new architecture centered around effects --- [[https://discuss.ocaml.org/t/effect-composability-actual-callstack-vs-syntactic-scope/17536][only to discover that user-space effects and concurrency libraries don't really work well together]], since callbacks lose their scope (duh). That was the final straw.

We decided to run two 1-week stints to try rewriting the service in Rust and Go. We ended up choosing Rust. We still miss OCaml, but not having to implement and maintain our own http2/grpc/sip stack is a breath of fresh air.

So here we are --- we're gradually removing OCaml from our stack, and that's why we'd like to donate:

- [[https://github.com/dialohq/ocaml-grpc/tree/dialo][ocaml-grpc]] - the new code is on ~dialo~ branch, eio only at the moment, battle tested on production. It does have some bugs in it but few and it's pretty solid.
- [[https://github.com/dialohq/haha][haha (http2)]] - overall good but could be better. We cancel fibers too often, it's a very low hanging fruit to make it much faster.
- Our SIP stack --- this is currently not open source, but we're happy to share the source code with the right person or team.

Please write dms to me and feel free to ask me or @adamchol about specifics.
      



* ppx_mixins: slightly more elegant mixin syntax
:PROPERTIES:
:CUSTOM_ID: 13
:END:
Archive: https://discuss.ocaml.org/t/ann-ppx-mixins-slightly-more-elegant-mixin-syntax/18001/1

** Sacha Ayoun announced


Hello,

I've written a tiny ppx called [[https://github.com/soteria-tools/ppx_mixins][~ppx_mixins~]] so that one can write:
#+begin_src ocaml
type u [@@mixins Map.OrderedType + Printable]
#+end_src
which gets desugared to
#+begin_src ocaml
type u
include Map.OrderedType with type t := u
include Printable with type t := u
#+end_src
Not much but increases readability in a codebase that uses the "mixin" pattern a lot

*** Constructing type signatures

In the upcoming release, one can also write
#+begin_src ocaml
module type M = [%mixins Map.OrderedType + Printable]
(* desugars to *)
module type M = sig 
   type t 
   include Map.OrderedType with type t := t
   include Printable with type t := t
end
#+end_src

*** Additional features
One can also override other types, e.g.
#+begin_src ocaml
type u [@@mixins Mappable(key = int; value := v)]
(* desugars to *)
type u
include Mappable with type t := u and type key = int and type value := v
#+end_src

*** Limitations

- No support for parametric types, e.g. ~with type 'a u = 'a v~
- No support for tuple and function types, e.g. ~with type t = int -> bool~

This is because the preprocessor parses the payload as an expression, and these don't parse nicely a expressions.
Deeper support (e.g. for mixins with type parameters) would probably also require language support.
      



* Experience Report: Refining Dune’s Dependency Graph
:PROPERTIES:
:CUSTOM_ID: 14
:END:
Archive: https://discuss.ocaml.org/t/experience-report-refining-dune-s-dependency-graph/18002/1

** Robin Bate Boerop announced


*Refining Dune's Dependency Graph: Per-Module Library Filtering*

I've been working on improving Dune's inter-library dependency tracking, and wanted to share the experience --- both the technical details and what it's like as a first-time contributor to this large open source OCaml project.

*** The Problem I Took On

When ~libA~ depends on ~libB~, Dune gives every module in ~libA~ a glob dependency on /all/ ~.cmi~ files in ~libB~. If any ~.cmi~ in ~libB~ changes, every module in ~libA~ is recompiled --- even modules that never reference ~libB~.

For projects with many libraries, this creates a cascade of unnecessary recompilations. The issue that tracks this matter [[https://github.com/ocaml/dune/issues/4572][#4572]] has been open since 2021.

