2026.04.21.html
<div id="outline-container-orgde70a70" class="outline-3">
<h3 id="orgde70a70">Wojtek Czekalski announced</h3>
<div class="outline-text-3" id="text-orgde70a70">
<p>
As we're moving off OCaml at <a href="https://dialo.ai/">dialo</a>, we'd like to donate the libraries we built to people who will properly maintain them. We built a highly performant telephony system using OCaml, but as a small team we ended up maintaining too much software for our liking.
</p>

<p>
We initially built a SIP server implementation in OCaml, which was a perfect fit. We needed to connect it to the rest of our system in a language agnostic way. We chose gRPC and that's where things got difficult.
</p>

<p>
At a smaller scale our own buggy implementation of gRPC on top of <a href="https://github.com/anmonteiro/ocaml-h2">h2</a> was good enough. Then we started scaling and at the same time transitioned to OCaml 5.0. The combination of those factors resulted in:
</p>

<ol class="org-ol">
<li>Performance regressions in 5.0 related to memory management, both inside of app code, SIP stack, and inside of h2.</li>
<li>We needed a more robust implementation of gRPC to handle errors and edge cases better.</li>
</ol>

<p>
Long story short we ended up:
</p>

<ol class="org-ol">
<li>Writing our own implementation of <a href="https://github.com/dialohq/haha">http2</a></li>
<li>Rewriting the gRPC library exclusively for eio to limit the scope together with <a href="https://github.com/dialohq/ocaml-grpc/blob/dialo/examples/routeguide/src/client.ml">decent codegen</a> and robust</li>
</ol>

<p>
Then, in late 2025, we had to add new features to the SIP server and something inside us just broke. The SIP server had accumulated quite a bit of legacy code over 3.5 years, so we wanted to rewrite some parts. We were extremely excited to build the new architecture centered around effects &mdash; <a href="https://discuss.ocaml.org/t/effect-composability-actual-callstack-vs-syntactic-scope/17536">only to discover that user-space effects and concurrency libraries don't really work well together</a>, since callbacks lose their scope (duh). That was the final straw.
</p>

<p>
We decided to run two 1-week stints to try rewriting the service in Rust and Go. We ended up choosing Rust. We still miss OCaml, but not having to implement and maintain our own http2/grpc/sip stack is a breath of fresh air.
</p>

<p>
So here we are &mdash; we're gradually removing OCaml from our stack, and that's why we'd like to donate:
</p>

<ul class="org-ul">
<li><a href="https://github.com/dialohq/ocaml-grpc/tree/dialo">ocaml-grpc</a> - the new code is on <code>dialo</code> branch, eio only at the moment, battle tested on production. It does have some bugs in it but few and it's pretty solid.</li>
<li><a href="https://github.com/dialohq/haha">haha (http2)</a> - overall good but could be better. We cancel fibers too often, it's a very low hanging fruit to make it much faster.</li>
<li>Our SIP stack &mdash; this is currently not open source, but we're happy to share the source code with the right person or team.</li>
</ul>

<p>
Please write dms to me and feel free to ask me or @adamchol about specifics.
</p>
</div>
</div>
</div>
<div id="outline-container-13" class="outline-2">
<h2 id="13">ppx_mixins: slightly more elegant mixin syntax</h2>
<div class="outline-text-2" id="text-13">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ppx-mixins-slightly-more-elegant-mixin-syntax/18001/1">https://discuss.ocaml.org/t/ann-ppx-mixins-slightly-more-elegant-mixin-syntax/18001/1</a>
</p>
</div>
<div id="outline-container-orgd8003c6" class="outline-3">
<h3 id="orgd8003c6">Sacha Ayoun announced</h3>
<div class="outline-text-3" id="text-orgd8003c6">
<p>
Hello,
</p>

<p>
I've written a tiny ppx called <a href="https://github.com/soteria-tools/ppx_mixins"><code>ppx_mixins</code></a> so that one can write:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">type</span> <span style="color: #444fcf; font-weight: bold;">u</span> <span style="color: #a7601f;">[@@mixins Map.OrderedType + Printable]</span>
</code></pre>
</div>
<p>
which gets desugared to
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">type</span> <span style="color: #444fcf; font-weight: bold;">u</span>
<span style="color: #242521; font-weight: bold;">include</span> <span style="color: #557400; font-weight: bold;">Map.OrderedType</span> <span style="color: #242521; font-weight: bold;">with type</span> <span style="color: #444fcf; font-weight: bold;">t</span> := u
<span style="color: #242521; font-weight: bold;">include</span> <span style="color: #557400; font-weight: bold;">Printable</span> <span style="color: #242521; font-weight: bold;">with type</span> <span style="color: #444fcf; font-weight: bold;">t</span> := u
</code></pre>
</div>
<p>
Not much but increases readability in a codebase that uses the "mixin" pattern a lot
</p>
</div>
<div id="outline-container-orgefab853" class="outline-4">
<h4 id="orgefab853">Constructing type signatures</h4>
<div class="outline-text-4" id="text-orgefab853">
<p>
In the upcoming release, one can also write
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">module type</span> <span style="color: #557400; font-weight: bold;">M</span> = <span style="color: #a7601f; background-color: #ebebeb;">[%mixins</span> <span style="color: #557400; font-weight: bold;">Map.</span><span style="color: #242521;">OrderedType</span> + <span style="color: #242521;">Printable</span><span style="color: #a7601f; background-color: #ebebeb;">]</span>
<span style="color: #8f6f4a; font-style: italic;">(* </span><span style="color: #8f6f4a; font-style: italic;">desugars to</span><span style="color: #8f6f4a; font-style: italic;"> *)</span>
<span style="color: #242521; font-weight: bold;">module type</span> <span style="color: #557400; font-weight: bold;">M</span> = <span style="color: #242521; font-weight: bold;">sig</span> 
   <span style="color: #242521; font-weight: bold;">type</span> <span style="color: #444fcf; font-weight: bold;">t</span> 
   <span style="color: #242521; font-weight: bold;">include</span> <span style="color: #557400; font-weight: bold;">Map.OrderedType</span> <span style="color: #242521; font-weight: bold;">with type</span> <span style="color: #444fcf; font-weight: bold;">t</span> := t
   <span style="color: #242521; font-weight: bold;">include</span> <span style="color: #557400; font-weight: bold;">Printable</span> <span style="color: #242521; font-weight: bold;">with type</span> <span style="color: #444fcf; font-weight: bold;">t</span> := t
<span style="color: #242521; font-weight: bold;">end</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgf3b871d" class="outline-4">
<h4 id="orgf3b871d">Additional features</h4>
<div class="outline-text-4" id="text-orgf3b871d">
<p>
One can also override other types, e.g.
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><code><span style="color: #242521; font-weight: bold;">type</span> <span style="color: #444fcf; font-weight: bold;">u</span> <span style="color: #a7601f;">[@@mixins Mappable(key = int; value := v)]</span>
<span style="color: #8f6f4a; font-style: italic;">(* </span><span style="color: #8f6f4a; font-style: italic;">desugars to</span><span style="color: #8f6f4a; font-style: italic;"> *)</span>
<span style="color: #242521; font-weight: bold;">type</span> <span style="color: #444fcf; font-weight: bold;">u</span>
<span style="color: #242521; font-weight: bold;">include</span> <span style="color: #557400; font-weight: bold;">Mappable</span> <span style="color: #242521; font-weight: bold;">with type</span> <span style="color: #444fcf; font-weight: bold;">t</span> := u <span style="color: #242521; font-weight: bold;">and type</span> <span style="color: #444fcf; font-weight: bold;">key</span> = int <span style="color: #242521; font-weight: bold;">and type</span> <span style="color: #444fcf; font-weight: bold;">value</span> := v
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org93bb1bf" class="outline-4">
<h4 id="org93bb1bf">Limitations</h4>
<div class="outline-text-4" id="text-org93bb1bf">
<ul class="org-ul">
<li>No support for parametric types, e.g. <code>with type 'a u = 'a v</code></li>
<li>No support for tuple and function types, e.g. <code>with type t = int -&gt; bool</code></li>
</ul>

<p>
This is because the preprocessor parses the payload as an expression, and these don't parse nicely a expressions.
Deeper support (e.g. for mixins with type parameters) would probably also require language support.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-14" class="outline-2">
<h2 id="14">Experience Report: Refining Dune’s Dependency Graph</h2>
<div class="outline-text-2" id="text-14">
<p>
Archive: <a href="https://discuss.ocaml.org/t/experience-report-refining-dune-s-dependency-graph/18002/1">https://discuss.ocaml.org/t/experience-report-refining-dune-s-dependency-graph/18002/1</a>
</p>
</div>
<div id="outline-container-orga755867" class="outline-3">
<h3 id="orga755867">Robin Bate Boerop announced</h3>
<div class="outline-text-3" id="text-orga755867">
<p>
<b>Refining Dune's Dependency Graph: Per-Module Library Filtering</b>
</p>

<p>
I've been working on improving Dune's inter-library dependency tracking, and wanted to share the experience &mdash; both the technical details and what it's like as a first-time contributor to this large open source OCaml project.
</p>
</div>
<div id="outline-container-org233a853" class="outline-4">
<h4 id="org233a853">The Problem I Took On</h4>
<div class="outline-text-4" id="text-org233a853">
<p>
When <code>libA</code> depends on <code>libB</code>, Dune gives every module in <code>libA</code> a glob dependency on <i>all</i> <code>.cmi</code> files in <code>libB</code>. If any <code>.cmi</code> in <code>libB</code> changes, every module in <code>libA</code> is recompiled &mdash; even modules that never reference <code>libB</code>.
</p>

<p>
For projects with many libraries, this creates a cascade of unnecessary recompilations. The issue that tracks this matter <a href="https://github.com/ocaml/dune/issues/4572">#4572</a> has been open since 2021.
</p>
</div>
</div>
