2026.04.21.html
<div id="outline-container-org51ab452" class="outline-4">
<h4 id="org51ab452">My Approach</h4>
<div class="outline-text-4" id="text-org51ab452">
<p>
Dune already runs <code>ocamldep</code> to compute intra-library module dependencies. The key insight: that same output tells us which <i>libraries</i> each module references, via their entry module names. We can use this to filter both the build dependencies and the <code>-I~/</code>-H~ compiler flags per-module.
</p>

<p>
The implementation (<a href="https://github.com/ocaml/dune/pull/14116">PR #14116</a> and <a href="https://github.com/ocaml/dune/pull/14186">PR #14186</a>) works as follows:
</p>

<ol class="org-ol">
<li>For each module and its transitive intra-library dependencies, read the <code>ocamldep</code> output (both <code>.ml</code> and <code>.mli</code>)</li>
<li>Union all referenced module names, including <code>-open</code> flags</li>
<li>Map those names to libraries via a <code>Lib_index</code></li>
<li>Transitively close the filtered library set via <code>Lib.closure</code></li>
<li>Use the result for both hidden deps and <code>-I~/</code>-H~ compiler flags, partitioning into direct (visible via <code>-I</code>) and hidden (via <code>-H</code>) based on <code>requires_compile</code> membership</li>
</ol>

<p>
With both deps and flags filtered, a clean build will fail if a module references a library it doesn't declare &mdash; previously, overly-broad <code>-I</code> flags could mask such errors.
</p>
</div>
</div>
<div id="outline-container-org9587045" class="outline-4">
<h4 id="org9587045">A False Start</h4>
<div class="outline-text-4" id="text-org9587045">
<p>
My first attempt (<a href="https://github.com/ocaml/dune/pull/14021">PR #14021</a>) tried to implement the filtering in a single PR without sufficient test coverage. It was closed after review revealed that the approach was fragile in edge cases I hadn't anticipated &mdash; particularly around transparent module aliases and virtual libraries.
</p>
</div>
</div>
<div id="outline-container-org357c2ff" class="outline-4">
<h4 id="org357c2ff">Challenges</h4>
<div class="outline-text-4" id="text-org357c2ff">
<p>
<b>Transparent module aliases.</b> OCaml's module alias mechanism means <code>ocamldep</code> doesn't always report all libraries a module transitively depends on. If <code>libB</code> has <code>module M = LibC.Something</code>, and a module in <code>libA</code> uses <code>LibB.M</code>, <code>ocamldep</code> reports <code>LibB</code> but not <code>LibC</code>. The fix: transitively close the filtered library set using <code>Lib.closure</code>, bounded by the compilation context.
</p>

<p>
<b>Root modules.</b> The <code>(root_module)</code> stanza creates a module that implicitly aliases all libraries in the compilation context. When <code>ocamldep</code> reports a reference to a root module, we can't determine which underlying libraries are actually needed, so we fall back to the full dependency set.
</p>

<p>
<b>Virtual libraries.</b> When virtual library implementations are present in the compilation context, parameter libraries may not appear in <code>requires_compile</code>, so filtering could miss them. Another fallback case.
</p>

<p>
<b>Menhir-generated modules.</b> These mock modules aren't in the <code>ocamldep</code> dependency graph, so we skip filtering for them.
</p>

<p>
<b>Null build overhead.</b> The filtering reads <code>.d</code> files and computes library closures per-module. On a fresh <code>dune</code> process (no memo cache), this is new work on every build &mdash; including null builds where nothing changed. This is a real trade-off: better incremental rebuild performance at the cost of some null-build overhead.
</p>
</div>
</div>
<div id="outline-container-org42d2331" class="outline-4">
<h4 id="org42d2331">Prerequisite Test PRs</h4>
<div class="outline-text-4" id="text-org42d2331">
<p>
Before the implementation PRs, I submitted six test-only PRs to document existing behavior and establish a safety net:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/dune/pull/14017">#14017</a> &mdash; Baseline tests documenting current inter-library recompilation behavior</li>
<li><a href="https://github.com/ocaml/dune/pull/14031">#14031</a> &mdash; Test documenting module name shadowing between stanzas and libraries</li>
<li><a href="https://github.com/ocaml/dune/pull/14100">#14100</a> &mdash; Test verifying library file deps in compilation rules and sandboxed builds</li>
<li><a href="https://github.com/ocaml/dune/pull/14101">#14101</a> &mdash; Test verifying transparent alias incremental build safety</li>
<li><a href="https://github.com/ocaml/dune/pull/14129">#14129</a> &mdash; Test verifying incremental builds with alias re-exported libraries</li>
<li><a href="https://github.com/ocaml/dune/pull/14178">#14178</a> &mdash; Test documenting <code>ocamldep</code> behavior with transparent alias chains</li>
</ul>

<p>
This made the implementation PRs' diffs focused on the actual change, and gave reviewers confidence that existing behavior was preserved. It also helped me understand the edge cases that tripped up my first attempt.
</p>
</div>
</div>
<div id="outline-container-orgc0850de" class="outline-4">
<h4 id="orgc0850de">The Review Process</h4>
<div class="outline-text-4" id="text-orgc0850de">
<p>
The Dune maintainers (<a href="https://github.com/rgrinberg">@rgrinberg</a> and <a href="https://github.com/art-w">@art-w</a>) provided thorough, constructive reviews. Some highlights:
</p>

<ul class="org-ul">
<li>Replacing my hand-rolled transitive closure with <code>Lib.closure</code> from the existing library &mdash; a cleaner approach I wouldn't have found without familiarity with Dune's internals</li>
<li>Identifying that both <code>.ml</code> and <code>.mli</code> ocamldep output need to be read, since the interface can reference different libraries than the implementation</li>
<li>Suggesting per-module <code>-I~/</code>-H~ flag filtering, which makes clean builds more precise and improves caching</li>
<li>Questioning every fallback case and special-cased module kind, leading to simpler code</li>
</ul>

<p>
The PRs went through significant refactoring during review &mdash; the final versions are substantially tighter than the initial submissions.
</p>
</div>
</div>
<div id="outline-container-org20d6b43" class="outline-4">
<h4 id="org20d6b43">What Could Be Better</h4>
<div class="outline-text-4" id="text-org20d6b43">
<p>
Working on this was a positive experience overall, but a few things created friction:
</p>

<p>
<b>No way to benchmark before merging.</b> The null-build overhead question came up late in the process. I discovered through manual benchmarking that the change added \~70% to null build time &mdash; a significant regression. Dune's benchmark CI workflow runs only on pushes to main, not on PRs. Contributor-accessible performance tooling would help catch regressions before they land.
</p>

<p>
<b>Review momentum vs. rebasing.</b> The test PRs merged quickly, but the implementation PR required multiple rounds of review over days. Between rounds, main moves forward, requiring rebases that risk introducing conflicts. The contributor carries the burden of keeping branches fresh. This is compounded when PRs depend on each other &mdash; every rebase of #14116 required rebasing #14186 as well. GitHub has no first-class support for PR stacks, so this is manual and error-prone. Of course, all GitHub-hosted repos suffer from this.
</p>

<p>
<b>Flaky CI</b>. Many CI runs had errors that were not related to my code. It was often an upstream provider of an OCaml package that was unreachable or faulty (temporarily). These problems often resolved themselves, but caused day-long delays in the PR lifetimes. The problem stems from the setup code that is run and re-run over and over in CI jobs.
</p>
</div>
</div>
<div id="outline-container-org17cdb7e" class="outline-4">
<h4 id="org17cdb7e">Reflections</h4>
<div class="outline-text-4" id="text-org17cdb7e">
<p>
The Dune codebase is well-structured, with clear separation between the build engine, rule generation, and scheduler. It is also of good quality, making it feel like time spent on keeping the quality high is worthwhile.
</p>

<p>
I found the cram test infrastructure good for testing. Each test scenario is a self-contained shell script with expected output, making it easy to document and verify exact recompilation behavior. It inspires confidence in the code.
</p>

<p>
The maintainers have been responsive and the review process, while slowed by thoroughness, is collaborative and professional. Thank you, maintainers!
</p>
</div>
</div>
</div>
