2026.04.21.org
** Steffen Smolka then replied


#+begin_quote
GitHub has no first-class support for PR stacks
#+end_quote

It does now: https://github.github.com/gh-stack/
      



* First beta release of OCaml 5.5.0
:PROPERTIES:
:CUSTOM_ID: 15
:END:
Archive: https://discuss.ocaml.org/t/first-beta-release-of-ocaml-5-5-0/18006/1

** octachron announced


With most developer tools available and the good stability of the compiler, I am happy to announce the first beta release of OCaml 5.5.0.

Compared to the last alpha, this new version improves the manpage for
ocamlopt and fixes:

- two runtime bugs (for ephemerons and the bytecode interpreter)
- two type system bugs (for classes and module-dependent functions)
- three warning or error message bugs

(See the Changelog below for a full list).

Concerning the associated compiler tools, most of them are already
available (as least in a preview version), and there are patches in
progress for the remaining ones. You can track the last remaining
update efforts on the [[https://github.com/ocaml/opam-repository/issues/29463][release readiness meta-issue]].

Thus, it should be safe to test your libraries and programs with the
new version OCaml 5.5.0 version in preparation of the final release.
If everything goes well, we might see a release in May.

If you find any bugs, please report them to the [[https://github.com/ocaml/ocaml/issues][GitHub issue tracker]].

If you are interested by the full list of new features and bug fixes, the
[[https://github.com/ocaml/ocaml/blob/5.5/Changes][changelog for OCaml 5.5.0]] is the most up-to-date resource.

  
Happy hacking,
Florian Angeletti for the OCaml team.

*** Installation Instructions

The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:

#+begin_example
    opam update
    opam switch create 5.5.0~beta1
#+end_example

The source code for the beta is also available at these addresses:

- GitHub: https://github.com/ocaml/ocaml/archive/5.5.0-beta1.tar.gz
- OCaml archives at Inria: https://caml.inria.fr/pub/distrib/ocaml-5.5/ocaml-5.5.0~beta1.tar.gz

*** Fine-Tuned Compiler Configuration

If you want to tweak the configuration of the compiler, you can switch to the option variant with:


#+begin_example
    opam update
    opam switch create <switch_name> ocaml-variants.5.5.0~beta1+options <option_list>
#+end_example

where ~option_list~ is a space separated list of ~ocaml-option-*~ packages. For instance, for a flambda and no-flat-float-array switch:

#+begin_example
    opam switch create 5.5.0~beta1+flambda+nffa ocaml-variants.5.5.0~beta1+options ocaml-option-flambda ocaml-option-no-flat-float-array
#+end_example

All available options can be listed with ~opam search ocaml-option~.

*** Changes compared to the last alpha

**** Documentation update
- [[https://github.com/ocaml/ocaml/issues/14684][#14684]]: Improve ocamlopt's manual page
  (Samuel Hym, review by Florian Angeletti)

**** Runtime fixes
- [[https://github.com/ocaml/ocaml/issues/14644][#14644]], [[https://github.com/ocaml/ocaml/issues/14647][#14647]]: Fix a bug related to unhandled effects in bytecode.
  (Vincent Laviron, report by Thibaut Mattio,
   review by Nicolás Ojeda Bär, Stephen Dolan and Olivier Nicole)
- [[https://github.com/ocaml/ocaml/issues/14349][#14349]], [[https://github.com/ocaml/ocaml/issues/14718][#14718]]: runtime, fix in the orphaning of ephemerons
  (Gabriel Scherer, review by Olivier Nicole and Damien Doligez,
   report by Jan Midtgaard)

**** Type system fixes
- [[https://github.com/ocaml/ocaml/issues/14557][#14557]], [[https://github.com/ocaml/ocaml/issues/12150][#12150]], [[https://github.com/ocaml/ocaml/issues/14696][#14696]]: ensure that the self type of class cannot escape
  through type constraints.
  (Leo White, review by Florian Angeletti)
- [[https://github.com/ocaml/ocaml/issues/14667][#14667]]: enable application related warnings for module-dependent functions
  (Florian Angeletti, review by Gabriel Scherer)

**** Error messages and warning fixes
- [[https://github.com/ocaml/ocaml/issues/14690][#14690]]: Fix ~Name_type_mismatch~ error message when the expected type is an
  alias: print the expanded path on the right-hand side of the equality, not
  the alias twice.
  (Weixie Cui, review by Florian Angeletti)
- [[https://github.com/ocaml/ocaml/issues/14719][#14719]], [[https://github.com/ocaml/ocaml/issues/14721][#14721]]: compute arity correctly for module-dependent function
  (Florian Angeletti, report by Jeremy Yallop, review by Stefan Muenzel)
- [[https://github.com/ocaml/ocaml/issues/14655][#14655]], [[https://github.com/ocaml/ocaml/issues/14691][#14691]]: check for size overflow in caml_ba_reshape
  (Stephen Dolan, review by Xavier Leroy)
      



* ocgtk 0.1: OCaml bindings for GTK 4 (preview release)
:PROPERTIES:
:CUSTOM_ID: 16
:END:
Archive: https://discuss.ocaml.org/t/ann-ocgtk-0-1-ocaml-bindings-for-gtk-4-preview-release/17944/5

** Continuing this thread, Chris Armstrong announced


/ocgtk preview1 release has landed in opam./

(preview0 was abandoned as considerable work was required to get it building on other Linux distributions and Mac). A special thanks to @jmid for helping me get it over the line.

In addition to the features above, it includes:

- Extended support for more GLib types, including integer primitives (guint8, int16, guint32, etc) and lists (GLib.SList and GLib.List)
- Gobject interfaces 

The combination of the above enables more methods to be generated (that were previously excluded) when they include those types in their parameters and/or return types, opening up much more of the  API surface of GTK (and related libraries).

*Next steps*: my focus now is on internal cleanup and reorganisation to better structure the tests and split gir_gen (the GObject code generator) into a seperate dune project. This will reduce the dependency list considerably and enable targeting earlier OCaml versions, as well as reducing release headaches related to gir_gen (which is not required by packages just using ocgtk)
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe to the [[https://sympa.inria.fr/sympa/info/caml-list][caml-list]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
