2026.04.21.html
<div id="outline-container-orge36abb3" class="outline-3">
<h3 id="orge36abb3">Steffen Smolka then replied</h3>
<div class="outline-text-3" id="text-orge36abb3">
<blockquote>
<p>
GitHub has no first-class support for PR stacks
</p>
</blockquote>

<p>
It does now: <a href="https://github.github.com/gh-stack/">https://github.github.com/gh-stack/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-15" class="outline-2">
<h2 id="15">First beta release of OCaml 5.5.0</h2>
<div class="outline-text-2" id="text-15">
<p>
Archive: <a href="https://discuss.ocaml.org/t/first-beta-release-of-ocaml-5-5-0/18006/1">https://discuss.ocaml.org/t/first-beta-release-of-ocaml-5-5-0/18006/1</a>
</p>
</div>
<div id="outline-container-orgec8631f" class="outline-3">
<h3 id="orgec8631f">octachron announced</h3>
<div class="outline-text-3" id="text-orgec8631f">
<p>
With most developer tools available and the good stability of the compiler, I am happy to announce the first beta release of OCaml 5.5.0.
</p>

<p>
Compared to the last alpha, this new version improves the manpage for
ocamlopt and fixes:
</p>

<ul class="org-ul">
<li>two runtime bugs (for ephemerons and the bytecode interpreter)</li>
<li>two type system bugs (for classes and module-dependent functions)</li>
<li>three warning or error message bugs</li>
</ul>

<p>
(See the Changelog below for a full list).
</p>

<p>
Concerning the associated compiler tools, most of them are already
available (as least in a preview version), and there are patches in
progress for the remaining ones. You can track the last remaining
update efforts on the <a href="https://github.com/ocaml/opam-repository/issues/29463">release readiness meta-issue</a>.
</p>

<p>
Thus, it should be safe to test your libraries and programs with the
new version OCaml 5.5.0 version in preparation of the final release.
If everything goes well, we might see a release in May.
</p>

<p>
If you find any bugs, please report them to the <a href="https://github.com/ocaml/ocaml/issues">GitHub issue tracker</a>.
</p>

<p>
If you are interested by the full list of new features and bug fixes, the
<a href="https://github.com/ocaml/ocaml/blob/5.5/Changes">changelog for OCaml 5.5.0</a> is the most up-to-date resource.
</p>


<p>
Happy hacking,
Florian Angeletti for the OCaml team.
</p>
</div>
<div id="outline-container-org4dcafbc" class="outline-4">
<h4 id="org4dcafbc">Installation Instructions</h4>
<div class="outline-text-4" id="text-org4dcafbc">
<p>
The base compiler can be installed as an opam switch with the following commands
on opam 2.1 and later:
</p>

<pre class="example" id="org3c834e4">
opam update
opam switch create 5.5.0~beta1
</pre>

<p>
The source code for the beta is also available at these addresses:
</p>

<ul class="org-ul">
<li>GitHub: <a href="https://github.com/ocaml/ocaml/archive/5.5.0-beta1.tar.gz">https://github.com/ocaml/ocaml/archive/5.5.0-beta1.tar.gz</a></li>
<li>OCaml archives at Inria: <a href="https://caml.inria.fr/pub/distrib/ocaml-5.5/ocaml-5.5.0~beta1.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-5.5/ocaml-5.5.0~beta1.tar.gz</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb8283a5" class="outline-4">
<h4 id="orgb8283a5">Fine-Tuned Compiler Configuration</h4>
<div class="outline-text-4" id="text-orgb8283a5">
<p>
If you want to tweak the configuration of the compiler, you can switch to the option variant with:
</p>


<pre class="example" id="org6cba654">
opam update
opam switch create &lt;switch_name&gt; ocaml-variants.5.5.0~beta1+options &lt;option_list&gt;
</pre>

<p>
where <code>option_list</code> is a space separated list of <code>ocaml-option-*</code> packages. For instance, for a flambda and no-flat-float-array switch:
</p>

<pre class="example" id="orgbcbbb66">
opam switch create 5.5.0~beta1+flambda+nffa ocaml-variants.5.5.0~beta1+options ocaml-option-flambda ocaml-option-no-flat-float-array
</pre>

<p>
All available options can be listed with <code>opam search ocaml-option</code>.
</p>
</div>
</div>
<div id="outline-container-orge781fe6" class="outline-4">
<h4 id="orge781fe6">Changes compared to the last alpha</h4>
<div class="outline-text-4" id="text-orge781fe6">
</div>
<ul class="org-ul">
<li><a id="org9504415"></a>Documentation update<br />
<div class="outline-text-5" id="text-org9504415">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14684">#14684</a>: Improve ocamlopt's manual page
(Samuel Hym, review by Florian Angeletti)</li>
</ul>
</div>
</li>
<li><a id="orga9fa308"></a>Runtime fixes<br />
<div class="outline-text-5" id="text-orga9fa308">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14644">#14644</a>, <a href="https://github.com/ocaml/ocaml/issues/14647">#14647</a>: Fix a bug related to unhandled effects in bytecode.
(Vincent Laviron, report by Thibaut Mattio,
 review by Nicolás Ojeda Bär, Stephen Dolan and Olivier Nicole)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/14349">#14349</a>, <a href="https://github.com/ocaml/ocaml/issues/14718">#14718</a>: runtime, fix in the orphaning of ephemerons
(Gabriel Scherer, review by Olivier Nicole and Damien Doligez,
 report by Jan Midtgaard)</li>
</ul>
</div>
</li>
<li><a id="org240ce72"></a>Type system fixes<br />
<div class="outline-text-5" id="text-org240ce72">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14557">#14557</a>, <a href="https://github.com/ocaml/ocaml/issues/12150">#12150</a>, <a href="https://github.com/ocaml/ocaml/issues/14696">#14696</a>: ensure that the self type of class cannot escape
through type constraints.
(Leo White, review by Florian Angeletti)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/14667">#14667</a>: enable application related warnings for module-dependent functions
(Florian Angeletti, review by Gabriel Scherer)</li>
</ul>
</div>
</li>
<li><a id="org424c420"></a>Error messages and warning fixes<br />
<div class="outline-text-5" id="text-org424c420">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/issues/14690">#14690</a>: Fix <code>Name_type_mismatch</code> error message when the expected type is an
alias: print the expanded path on the right-hand side of the equality, not
the alias twice.
(Weixie Cui, review by Florian Angeletti)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/14719">#14719</a>, <a href="https://github.com/ocaml/ocaml/issues/14721">#14721</a>: compute arity correctly for module-dependent function
(Florian Angeletti, report by Jeremy Yallop, review by Stefan Muenzel)</li>
<li><a href="https://github.com/ocaml/ocaml/issues/14655">#14655</a>, <a href="https://github.com/ocaml/ocaml/issues/14691">#14691</a>: check for size overflow in caml_ba_reshape
(Stephen Dolan, review by Xavier Leroy)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-16" class="outline-2">
<h2 id="16">ocgtk 0.1: OCaml bindings for GTK 4 (preview release)</h2>
<div class="outline-text-2" id="text-16">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocgtk-0-1-ocaml-bindings-for-gtk-4-preview-release/17944/5">https://discuss.ocaml.org/t/ann-ocgtk-0-1-ocaml-bindings-for-gtk-4-preview-release/17944/5</a>
</p>
</div>
<div id="outline-container-org482baf0" class="outline-3">
<h3 id="org482baf0">Continuing this thread, Chris Armstrong announced</h3>
<div class="outline-text-3" id="text-org482baf0">
<p>
<i>ocgtk preview1 release has landed in opam.</i>
</p>

<p>
(preview0 was abandoned as considerable work was required to get it building on other Linux distributions and Mac). A special thanks to @jmid for helping me get it over the line.
</p>

<p>
In addition to the features above, it includes:
</p>

<ul class="org-ul">
<li>Extended support for more GLib types, including integer primitives (guint8, int16, guint32, etc) and lists (GLib.SList and GLib.List)</li>
<li>Gobject interfaces</li>
</ul>

<p>
The combination of the above enables more methods to be generated (that were previously excluded) when they include those types in their parameters and/or return types, opening up much more of the  API surface of GTK (and related libraries).
</p>

<p>
<b>Next steps</b>: my focus now is on internal cleanup and reorganisation to better structure the tests and split gir_gen (the GObject code generator) into a seperate dune project. This will reduce the dependency list considerably and enable targeting earlier OCaml versions, as well as reducing release headaches related to gir_gen (which is not required by packages just using ocgtk)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc3cc6cf" class="outline-2">
<h2 id="orgc3cc6cf">Old CWN</h2>
<div class="outline-text-2" id="text-orgc3cc6cf">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="org6025f46">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
